app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-03-15 00:43:42.951683"], ["updated_at", "2022-03-15 00:43:42.951683"]]
---
    def create
      @student = Student.new(student_params)
      @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
      @student = Student.find(params[:id])